adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_umac.s
        DCD     UARTE131_IRQHandler
        DCD     PDM130_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER132_IRQHandler
        DCD     TIMER133_IRQHandler
        DCD     PWM131_IRQHandler
        DCD     UARTE132_IRQHandler
        DCD     UARTE133_IRQHandler
        DCD     PDM131_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER134_IRQHandler
        DCD     TIMER135_IRQHandler
        DCD     PWM132_IRQHandler
        DCD     UARTE134_IRQHandler
        DCD     UARTE135_IRQHandler
        DCD     PDM132_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER136_IRQHandler
        DCD     TIMER137_IRQHandler
        DCD     PWM133_IRQHandler
        DCD     UARTE136_IRQHandler
        DCD     UARTE137_IRQHandler
        DCD     PDM133_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved

__Vectors_End
__Vectors                           EQU   __vector_table
__Vectors_Size                      EQU   __Vectors_End - __Vectors


; Default handlers.
        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler

    jal ra, SystemInit
    j __iar_program_start

        ; Dummy exception handlers


        PUBWEAK UserSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserSoftware_Handler
        j .

        PUBWEAK SuperVisorSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorSoftware_Handler
        j .

        PUBWEAK MachineSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineSoftware_Handler
        j .

        PUBWEAK UserTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserTimer_Handler
        j .

        PUBWEAK SuperVisorTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorTimer_Handler
        j .

        PUBWEAK MachineTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineTimer_Handler
        j .

        PUBWEAK UserExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserExternal_Handler
        j .

        PUBWEAK SuperVisorExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorExternal_Handler
        j .

        PUBWEAK MachineExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineExternal_Handler
        j .

        PUBWEAK CLICSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLICSoftware_Handler
        j .


       ; Dummy interrupt handlers

        PUBWEAK  VPRCLIC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_0_IRQHandler
        j .

        PUBWEAK  VPRCLIC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_1_IRQHandler
        j .

        PUBWEAK  VPRCLIC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_2_IRQHandler
        j .

        PUBWEAK  VPRCLIC_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_3_IRQHandler
        j .

        PUBWEAK  VPRCLIC_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_4_IRQHandler
        j .

        PUBWEAK  VPRCLIC_5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_5_IRQHandler
        j .

        PUBWEAK  VPRCLIC_6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_6_IRQHandler
        j .

        PUBWEAK  VPRCLIC_7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_7_IRQHandler
        j .

        PUBWEAK  VPRCLIC_8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_8_IRQHandler
        j .

        PUBWEAK  VPRTIM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRTIM_IRQHandler
        j .

        PUBWEAK  RPU_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_0_IRQHandler
        j .

        PUBWEAK  RPU_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_1_IRQHandler
        j .

        PUBWEAK  RPU_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_2_IRQHandler
        j .

        PUBWEAK  RPU_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_3_IRQHandler
        j .

        PUBWEAK  RPU_EFS_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_EFS_0_IRQHandler
        j .

        PUBWEAK  RPU_EFS_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_EFS_1_IRQHandler
        j .

        PUBWEAK  LMAC_VPR_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LMAC_VPR_IRQHandler
        j .

        PUBWEAK  MVDMA_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA_IRQHandler
        j .

        PUBWEAK  IPCT_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_0_IRQHandler
        j .

        PUBWEAK  IPCT_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_1_IRQHandler
        j .

        PUBWEAK  IPCT_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_2_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_0_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_1_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_2_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_3_IRQHandler
        j .

        PUBWEAK  GPIOTE130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_0_IRQHandler
        j .

        PUBWEAK  GPIOTE130_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_1_IRQHandler
        j .

        PUBWEAK  GRTC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_0_IRQHandler
        j .

        PUBWEAK  GRTC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_1_IRQHandler
        j .

        PUBWEAK  GRTC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_2_IRQHandler
        j .

