adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_umac.s
        PUBWEAK  TIMER132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER132_IRQHandler
        j .

        PUBWEAK  TIMER133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER133_IRQHandler
        j .

        PUBWEAK  PWM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM131_IRQHandler
        j .

        PUBWEAK  UARTE132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE132_IRQHandler
        j .

        PUBWEAK  UARTE133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE133_IRQHandler
        j .

        PUBWEAK  PDM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM131_IRQHandler
        j .

        PUBWEAK  TIMER134_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER134_IRQHandler
        j .

        PUBWEAK  TIMER135_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER135_IRQHandler
        j .

        PUBWEAK  PWM132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM132_IRQHandler
        j .

        PUBWEAK  UARTE134_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE134_IRQHandler
        j .

        PUBWEAK  UARTE135_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE135_IRQHandler
        j .

        PUBWEAK  PDM132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM132_IRQHandler
        j .

        PUBWEAK  TIMER136_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER136_IRQHandler
        j .

        PUBWEAK  TIMER137_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER137_IRQHandler
        j .

        PUBWEAK  PWM133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM133_IRQHandler
        j .

        PUBWEAK  UARTE136_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE136_IRQHandler
        j .

        PUBWEAK  UARTE137_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UARTE137_IRQHandler
        j .

        PUBWEAK  PDM133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM133_IRQHandler
        j .

        END


